glcloud/keil_v5/ARM/PACK/.Web/NXP.MK22F25612_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd" schemaVersion="1.4">
  <name>MK22F25612_DFP</name>
  <vendor>NXP</vendor>
  <description>Device Family Pack for MK22F25612</description>
  <url>http://mcuxpresso.nxp.com/cmsis_pack/repo/</url>
  <license>Licenses.txt</license>
  <releases>
    <release version="11.0.1">Removed invalid entries from Software Content Register</release>
    <release version="11.0.0">NXP CMSIS packs based on MCUXpresso SDK 2.5.0</release>
    <release version="10.0.3">A problem with missing components from some example the projects were dependent on was fixed (KEX-4241); Incorrect path to linked libraries were fixed: a pack version was a static part of the path and hadn’t worked for pack versions other than v10.0.0 (KEX-4373); A problem with incorrectly defined XIP_BOOT_HEADER_ENABLE, XIP_BOOT_HEADER_DCD_ENABLE and XIP_EXTERNAL_FLASH preprocessor symbols was fixed (KEX-4553); Missing flash algorithms for MK27, MK28, LPC802 and LPC804 device family packs were added (KEX-4659).</release>
    <release version="10.0.2">NXP CMSIS packs based on MCUXpresso SDK 2.4.0</release>
    <release version="10.0.1">NXP CMSIS packs based on MCUXpresso SDK 2.3.1</release>
    <release version="10.0.0">NXP CMSIS packs with updated Clear BSD license, based on MCUXpresso SDK 2.3.0. NXP CMSIS pack will maintain independent versioning starting with 10.0.0</release>
    <release version="2.3.0">NXP MCUXpresso SDK 2.3.0 CMSIS packs with updated Clear BSD license</release>
  </releases>
  <keywords>
    <keyword>Device Family Pack</keyword>
  </keywords>
  <taxonomy>
    <description Cclass="Device" Cgroup="SDK Project Template">NXP MCUXpresso SDK RTE Device Project Template</description>
    <description Cclass="Device" Cgroup="SDK Drivers">NXP MCUXpresso SDK Peripheral Drivers</description>
    <description Cclass="Device" Cgroup="SDK Utilities">NXP MCUXpresso SDK Utilities</description>
    <description Cclass="CMSIS Driver">NXP MCUXpresso SDK Peripheral CMSIS Drivers</description>
    <description Cclass="Board Support" Cgroup="SDK Project Template">NXP MCUXpresso SDK Project Template</description>
    <description Cclass="Device" Cgroup="Startup">NXP MCUXpresso SDK Start up</description>
  </taxonomy>
  <devices>
    <family Dfamily="MK22F25612" Dvendor="NXP:11">
      <description>Kinetis® K22 MCUs have been optimized for cost-sensitive applications requiring low power flexibility and processing efficiency.Delivers industry-leading low power while providing significant bill-of-materials savings through smart on-chip integration.Includes options that support crystal-less USB design for reduced system cost and board space.Provides scalability with various levels of integration, offering a rich suite of analog, communication, timing and control peripherals to accommodate a wide range of requirements.Shares the comprehensive enablement and scalability of the Kinetis portfolio.</description>
      <device Dname="MK22FN128xxx12">
        <processor Dcore="Cortex-M4" Dfpu="SP_FPU" Dendian="Little-endian" Dclock="120000000"/>
        <environment name="iar">
          <file category="linkerfile" name="iar/MK22FN128xxx12_flash.icf"/>
        </environment>
        <memory name="PROGRAM_FLASH" start="0x00000000" size="0x020000" access="rx" default="1" startup="1"/>
        <memory name="SRAM_LOWER" start="0x1fffc000" size="0x4000" access="rw"/>
        <memory name="SRAM_UPPER" start="0x20000000" size="0x8000" access="rw" default="1"/>
        <algorithm name="arm/MK_P128.FLM" start="0x00000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x00007ed4" default="1"/>
        <algorithm name="arm/MK2x_FAC.FLM" start="0xffff0000" size="0x00000024" RAMstart="0x20000000" RAMsize="0x00008000" default="0"/>
        <debug svd="MK22F25612.xml"/>
        <variant Dvariant="MK22FN128CAH12">
          <compile header="fsl_device_registers.h" define="CPU_MK22FN128CAH12"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK22FN128CAH12/MK22FN128xxx12_flash.scf"</LMisc>
          </environment>
        </variant>
      </device>
      <device Dname="MK22FN256xxx12">
        <processor Dcore="Cortex-M4" Dfpu="SP_FPU" Dendian="Little-endian" Dclock="120000000"/>
        <environment name="iar">
          <file category="linkerfile" name="iar/MK22FN256xxx12_flash.icf"/>
        </environment>
        <memory name="PROGRAM_FLASH" start="0x00000000" size="0x040000" access="rx" default="1" startup="1"/>
        <memory name="SRAM_LOWER" start="0x1fffc000" size="0x4000" access="rw"/>
        <memory name="SRAM_UPPER" start="0x20000000" size="0x8000" access="rw" default="1"/>
        <algorithm name="arm/MK_P256.FLM" start="0x00000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>
        <algorithm name="arm/MK2x_FAC.FLM" start="0xffff0000" size="0x00000024" RAMstart="0x20000000" RAMsize="0x00001000" default="0"/>
        <debug svd="MK22F25612.xml"/>
        <variant Dvariant="MK22FN256CAH12">
          <compile header="fsl_device_registers.h" define="CPU_MK22FN256CAH12"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK22FN256CAH12/MK22FN256xxx12_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MK22FN256VDC12">
          <compile header="fsl_device_registers.h" define="CPU_MK22FN256VDC12"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK22FN256VDC12/MK22FN256xxx12_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MK22FN256VLH12">
          <compile header="fsl_device_registers.h" define="CPU_MK22FN256VLH12"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK22FN256VLH12/MK22FN256xxx12_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MK22FN256VLL12">
          <compile header="fsl_device_registers.h" define="CPU_MK22FN256VLL12"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK22FN256VLL12/MK22FN256xxx12_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MK22FN256VMP12">
          <compile header="fsl_device_registers.h" define="CPU_MK22FN256VMP12"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK22FN256VMP12/MK22FN256xxx12_flash.scf"</LMisc>
          </environment>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="cond_MCUXpressoConfigTools">
      <accept Dname="MK22FN128???12" Dvendor="NXP:11"/>
      <accept Dname="MK22FN256???12" Dvendor="NXP:11"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
